Tekla Open API Reference for Tekla Structures 2025
ProfileCatalog Constructor
Overload List
Name | Description
ProfileCatalog()
 Initiates a new instance of the control.
ProfileCatalog(String)
 Initiates a new instance of the control selecting the given profile.
Top
See Also
Reference
ProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace